.model small                  ; Встановлення малої моделі пам'яті
.stack 100h                   ; Виділення 256 байт під стек

.data                         ; Секція даних
    res db 6 dup('$')         ; Буфер для зберігання рядкового представлення чисел, ініціалізований символами '$'
    ocuranse dw 100 dup(0)    ; Масив для зберігання кількості входжень підстрічки
    string_length db 0        ; Змінна для зберігання довжини поточної стрічки
    string db 255 dup(0)      ; Буфер для зберігання поточної стрічки, що читається з вводу
    substring db 255 dup(0)   ; Буфер для зберігання підстрічки, по якій ведеться пошук
    substring_length db 0     ; Змінна для зберігання довжини підстрічки
    ocuranse_length db 0      ; Змінна для зберігання кількості записів в масиві ocuranse

.code                         ; Секція коду
main PROC                     ; Основна процедура програми
    mov ax, @data             ; Встановлення сегменту даних для програми
    mov ds, ax

    

    mov ah, 4Ch               ; Функція DOS для завершення програми
    int 21h                   ; Виклик DOS-преривання для завершення
main ENDP

end main
